cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "dart-lang/dart"
tap "spectralkh/tap"
tap "mas-cli/tap"

cask "adoptopenjdk8"
brew "curl"
brew "dart"
brew "gist"
brew "git"
brew "git-flow"
brew "grpc"
brew "nodenv"
brew "rbenv"
brew "rbenv-gemset"
brew "readline"
brew "ruby-build"
brew "ffmpeg"
brew "mas"
brew "mongodb"
brew "mysql-client"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "fish"
brew "xcodegen"
brew "python@2"
brew "python"
brew "protobuf"
brew "carthage"
brew "nodebrew"
cask "1password"
cask "alfred"
cask "bloomrpc"
cask "caffeine"
cask "cyberduck"
cask "discord"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "google-drive-file-stream"
cask "hyper"
cask "inkdrop"
cask "java"
cask "karabiner-elements"
cask "mysqlworkbench"
cask "paste"
cask "realm-studio"
cask "sketch"
cask "slack"
cask "sourcetree"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "xmind"
cask "flutter"
cask "skype"

mas "Xcode", id: 497799835
mas "LINE", id: 539883307
mas "BeFocused", id: 973134470
mas "Paste", id: 967805235
mas "RealmBrowser", id: 1007457278
mas "DevCleaner", id: 1388020431
mas "Yoink", id: 457622435
mas "TweetDeck", id: 485812721
mas "Keynote", id: 409183694
mas 'Amphetamine', id: 937984704
mas 'PiPifier', id: 1160374471
